### Ordinal Data

In [1]:
import datetime as dt

In [2]:
today=dt.datetime.today()

In [3]:
today

datetime.datetime(2020, 11, 17, 0, 1, 4, 564775)

In [4]:
today-dt.timedelta(1)

datetime.datetime(2020, 11, 16, 0, 1, 4, 564775)

In [9]:
days=[today-dt.timedelta(x) for x in range(15)]

In [10]:
days

[datetime.datetime(2020, 11, 17, 0, 1, 4, 564775),
 datetime.datetime(2020, 11, 16, 0, 1, 4, 564775),
 datetime.datetime(2020, 11, 15, 0, 1, 4, 564775),
 datetime.datetime(2020, 11, 14, 0, 1, 4, 564775),
 datetime.datetime(2020, 11, 13, 0, 1, 4, 564775),
 datetime.datetime(2020, 11, 12, 0, 1, 4, 564775),
 datetime.datetime(2020, 11, 11, 0, 1, 4, 564775),
 datetime.datetime(2020, 11, 10, 0, 1, 4, 564775),
 datetime.datetime(2020, 11, 9, 0, 1, 4, 564775),
 datetime.datetime(2020, 11, 8, 0, 1, 4, 564775),
 datetime.datetime(2020, 11, 7, 0, 1, 4, 564775),
 datetime.datetime(2020, 11, 6, 0, 1, 4, 564775),
 datetime.datetime(2020, 11, 5, 0, 1, 4, 564775),
 datetime.datetime(2020, 11, 4, 0, 1, 4, 564775),
 datetime.datetime(2020, 11, 3, 0, 1, 4, 564775)]

In [11]:
import pandas as pd

In [13]:
df=pd.DataFrame(days)
df.columns=['Days']

In [14]:
df

                         Days
0  2020-11-17 00:01:04.564775
1  2020-11-16 00:01:04.564775
2  2020-11-15 00:01:04.564775
3  2020-11-14 00:01:04.564775
4  2020-11-13 00:01:04.564775
5  2020-11-12 00:01:04.564775
6  2020-11-11 00:01:04.564775
7  2020-11-10 00:01:04.564775
8  2020-11-09 00:01:04.564775
9  2020-11-08 00:01:04.564775
10 2020-11-07 00:01:04.564775
11 2020-11-06 00:01:04.564775
12 2020-11-05 00:01:04.564775
13 2020-11-04 00:01:04.564775
14 2020-11-03 00:01:04.564775

In [27]:
df['Days'].dt.day_name()

0       Tuesday
1        Monday
2        Sunday
3      Saturday
4        Friday
5      Thursday
6     Wednesday
7       Tuesday
8        Monday
9        Sunday
10     Saturday
11       Friday
12     Thursday
13    Wednesday
14      Tuesday
Name: Days, dtype: object

In [30]:
#create new column week days
df['Week_Days']=df['Days'].dt.day_name()

In [32]:
df.head(7)

                        Days  Week_Days
0 2020-11-17 00:01:04.564775    Tuesday
1 2020-11-16 00:01:04.564775     Monday
2 2020-11-15 00:01:04.564775     Sunday
3 2020-11-14 00:01:04.564775   Saturday
4 2020-11-13 00:01:04.564775     Friday
5 2020-11-12 00:01:04.564775   Thursday
6 2020-11-11 00:01:04.564775  Wednesday

In [35]:
#first encoding method
map_object={'Monday':1,'Sunday':7,"Friday":5,"Saturday":6,"Tuesday":2,"Wednesday":3,"Thursday":4}
df['Week_ordinal_encoding']=df['Week_Days'].map(map_object)

In [36]:
df.head()

                        Days Week_Days  Week_ordinal_encoding
0 2020-11-17 00:01:04.564775   Tuesday                      2
1 2020-11-16 00:01:04.564775    Monday                      1
2 2020-11-15 00:01:04.564775    Sunday                      7
3 2020-11-14 00:01:04.564775  Saturday                      6
4 2020-11-13 00:01:04.564775    Friday                      5

In [38]:
train_set = pd.read_csv("http://archive.ics.uci.edu/ml/machine-learning-databases/adult/adult.data", header = None,index_col=None) 
train_set.head()

,0,1,2,3,4,5,6,7,8,9,10,11,12,13,14
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K

In [39]:
columns=[1,3,5,6,7,8,9,13]
train_set=train_set[columns]

In [42]:
train_set.head(2)

,Employement_type,Education,Status,job,Family_job,Race,Sex,Country
0,State-gov,Bachelors,Never-married,Adm-clerical,Not-in-family,White,Male,United-States
1,Self-emp-not-inc,Bachelors,Married-civ-spouse,Exec-managerial,Husband,White,Male,United-States

In [41]:
train_set.columns=['Employement_type','Education','Status','job','Family_job','Race','Sex','Country']

In [45]:
for features in train_set.columns[:]:
    print(f'{features} : {train_set[features].nunique()} Labels')

Employement_type : 9 Labels
Education : 16 Labels
Status : 7 Labels
job : 15 Labels
Family_job : 6 Labels
Race : 5 Labels
Sex : 2 Labels
Country : 42 Labels

In [50]:
train_set["Country_encoding"]=train_set['Country'].map(train_set['Country'].value_counts().rank().to_dict())

In [51]:
train_set["Country_encoding_2"]=train_set['Country'].map(train_set['Country'].value_counts().to_dict())

In [52]:
train_set.head()

,Employement_type,Education,Status,job,Family_job,Race,Sex,Country,Country_encoding,Country_encoding_2
0,State-gov,Bachelors,Never-married,Adm-clerical,Not-in-family,White,Male,United-States,42.0,29170
1,Self-emp-not-inc,Bachelors,Married-civ-spouse,Exec-managerial,Husband,White,Male,United-States,42.0,29170
2,Private,HS-grad,Divorced,Handlers-cleaners,Not-in-family,White,Male,United-States,42.0,29170
3,Private,11th,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,United-States,42.0,29170
4,Private,Bachelors,Married-civ-spouse,Prof-specialty,Wife,Black,Female,Cuba,33.0,95

### Target Encoding

In [94]:
df=pd.read_csv('/root/Downloads/train.csv',usecols=['Survived','Cabin'])
df.columns

Index(['Survived', 'Cabin'], dtype='object')

In [56]:
df.head()
df['Cabin'].fillna("Missing",inplace=True)

In [62]:
df.head()

   Survived Cabin
0         0     M
1         1     C
2         1     M
3         1     C
4         0     M

In [61]:
df['Cabin']=df['Cabin'].str.get(0)

In [64]:
df['Cabin'].unique()

array(['M', 'C', 'E', 'G', 'D', 'A', 'B', 'F', 'T'], dtype=object)

In [66]:
gb=df.groupby('Cabin')

In [76]:
pb=gb['Survived'].mean().sort_values(ascending=False).rank().to_dict()

In [77]:
df["Taget_encodin"]=df['Cabin'].map(pb)

In [82]:
df.sort_values('Taget_encodin')

     Survived Cabin  Taget_encodin
339         0     T            1.0
548         0     M            2.0
549         1     M            2.0
551         0     M            2.0
552         0     M            2.0
..        ...   ...            ...
625         0     D            9.0
621         1     D            9.0
327         1     D            9.0
215         1     D            9.0
748         0     D            9.0

[891 rows x 3 columns]

## Mean Encoding

In [84]:
df['Mean_encoding']=df['Cabin'].map(gb["Survived"].mean().to_dict())

## Probability ratio Encoding

In [95]:
df

     Survived Cabin
0           0   NaN
1           1   C85
2           1   NaN
3           1  C123
4           0   NaN
..        ...   ...
886         0   NaN
887         1   B42
888         0   NaN
889         1  C148
890         0   NaN

[891 rows x 2 columns]

##### Avoid Missing values

In [97]:
df['Cabin'].fillna("Missing",inplace=True)

#### Take all First Letter of Cabin column

In [99]:
df['Cabin']=df['Cabin'].str[0]

#### Group Dataset Onthe Basis Of Cabin And Survuved

In [105]:
Prob_survived=df.groupby('Cabin')['Survived'].mean()

In [109]:
data=pd.DataFrame(Prob_survived)
data

       Survived
Cabin
A      0.466667
B      0.744681
C      0.593220
D      0.757576
E      0.750000
F      0.615385
G      0.500000
M      0.299854
T      0.000000

In [110]:
data['Prob_died']=1-data["Survived"]

In [111]:
data

       Survived  Prob_died
Cabin
A      0.466667   0.533333
B      0.744681   0.255319
C      0.593220   0.406780
D      0.757576   0.242424
E      0.750000   0.250000
F      0.615385   0.384615
G      0.500000   0.500000
M      0.299854   0.700146
T      0.000000   1.000000

In [112]:
data["Prob_ratio"]=data['Survived']/data['Prob_died']

In [113]:
data

       Survived  Prob_died  Prob_ratio
Cabin
A      0.466667   0.533333    0.875000
B      0.744681   0.255319    2.916667
C      0.593220   0.406780    1.458333
D      0.757576   0.242424    3.125000
E      0.750000   0.250000    3.000000
F      0.615385   0.384615    1.600000
G      0.500000   0.500000    1.000000
M      0.299854   0.700146    0.428274
T      0.000000   1.000000    0.000000

In [115]:
map_obj=data['Prob_ratio'].to_dict()

In [116]:
df['Prob_Cabin_Ratio']=df['Cabin'].map(map_obj)

In [ ]:
df.head